Repository: burunduk/heroeswog-l10n-test
Catalog: tm/script04_EN_RU.tmx
Source language: en
Languages: ru

source: Arcane Tower
ru: Башня Аркан

source: A ghost floats down a staircase and glides up to you. It floats there, flickering, regarding you. At last it speaks. "It is well that you came here, traveller. I can help you."
ru: Призрак плывет вниз по лестнице и скользит прямо к вам. Он приближается, мерцая. Наконец он произносит. "Хорошо, что ты пришел сюда, путник. Я могу тебе помочь."

source: The ghost continues. "I can make you strong, give you power - perhaps as much power as I have! But it will cost you dearly. I can give you skill at attack, defense, spellcasting, or knowledge... in return, I require the same. One for one. Are you interested?"
ru: Призрак продолжает. "Я могу сделать тебя сильным, дать тебе мощь - возможно, сравнимую с моей! Но это будет стоить тебе немало, дорогуша. Я могу дать тебе навык Атаки, Защиты, Силы, или Знания... Взамен мне требуется то же самое. Одно за другое. Тебе это интересно?"

source: "Ah, traveller, you will know one day that you have erred."
ru: "Ах, путник, придет день, когда ты осознаешь свою ошибку."

source: "Of course. Who wouldn't be? I can teach you combat prowess or spell prowess. Do you prefer combat (attack or defense) or spells (spell power or knowledge)?"
ru: "Конечно. Кто бы отказался? Я могу обучить тебя искусствам войны или магическим искусствам. Ты предпочитаешь военные (Атаку или Защиту) или магические (Силу или Знание)?"

source: "Will it be attack or defense?"
ru: "Атаку или Защиту?"

source: "Will it be spell power or knowledge?"
ru: "Силу или Знание?"

source: "Will you pay me with your attack skill?"
ru: "Ты готов расплатиться со мной навыком Атаки?"

source: "Will you pay me with your defense skill?"
ru: "Ты готов расплатиться со мной навыком Защиты?"

source: "Will you pay me with your spell power?"
ru: "Ты готов расплатиться со мной навыкомr Силы?"

source: "Will you pay me with your knowledge?"
ru: "Ты готов расплатиться со мной навыком Знания?"

source: "Then you have nothing to pay me! Begone!"
ru: "Значит тебе нечем расплатиться! Проваливай!"

source: "You can't trick me! You have none to pay!"
ru: "Ты не сможешь надуть меня! Тебе нечем платить!"

source: The ghost admires its handiwork. "Your new powers are affecting you. I can see the change already..."
ru: Призрак восхищен делом своих рук. "Твоя новая мощь охватывает тебя. Я уже вижу перемену..."

source: "Excellent!"
ru: "Отлично!"

source: "Excellent! The same trade again?"
ru: "Отлично! Повторим на тех же условиях?"
